app/controllers/microposts_controller.rb

	def create
		@micropost = current_user.microposts.build(params[:micropost])
		if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "hello "], ["created_at", Thu, 29 Jun 2017 06:16:35 UTC +00:00], ["updated_at", Thu, 29 Jun 2017 06:16:35 UTC +00:00], ["user_id", 1]]