app/controllers/users_controller.rb

 def show
   @user=User.find(params[:id])
   @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

def create
  @user=User.new(params[:user])
  if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password", "password_confirmation", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

def update
  if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$UYvtjJ8e/4dOdIdjDlB3nug1I8StIRhs50LdKE6GsNzX9uMxOuFyO', "remember_token" = 'lSctJP0dMYTb5kj27u091A', "updated_at" = '2017-06-26 07:47:16.233797' WHERE "users"."id" = 1